test/flowOverCylinderRe3900/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myRhoPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.025;

deltaT          2e-8;

writeControl    timeStep;

writeInterval   50000;//10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  no;//yes;//

maxCo           0.5;

libs ("liblaserOPD.so");

functions
{
    OPDInfo
    {
        type            laserOPDInfo;
        // libs            (laserOPDInfoFunctionObjects);
        libs            ("liblaserOPDInfoFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   10;
        clouds
        (
            laserCloud
        );
    }
}

// ************************************************************************* //
