test/flowOverCylinderRe3900/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (136.1176 0 0);

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (136.1176 0 0);
        value           uniform (136.1176 0 0);
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform (136.1176 0 0);
        value           uniform (136.1176 0 0);
    }

    sym1
    {
        type            cyclic;
    }

    sym2
    {
        type            cyclic;
    }

    cylinder
    {
        type            noSlip;
    }
}

// ************************************************************************* //
