test/flowOverCylinderRe3900/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 288.15;
        value           uniform 288.15;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 288.15;
        value           uniform 288.15;
    }

    sym1
    {
        type            cyclic;
    }

    sym2
    {
        type            cyclic;
    }

    cylinder
    {
        type            fixedValue;
        value           uniform 288.15;
    }
}

// ************************************************************************* //
