test/flowOverCylinderRe3900/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 2e-5;

boundaryField
{
    inlet
    {
	    type            inletOutlet;
        inletValue      uniform 2e-05;
        value           uniform 2e-05;
    }

    outlet          
    {
        type            inletOutlet;
        inletValue      uniform 2e-05;
        value           uniform 2e-05;
    }

	sym1
	{
        type            cyclic;
	}

	sym2
	{
        type            cyclic;
	}

    cylinder
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
